#Задача 7.
#Користувачеві для розрахунку часу в дорозі треба вводити не номери станцій,
# а літери (A, B, C, D, E - це всі існуючі станції).
#Необхідно передбачити введення користувачем і маленьких, і великих літер
# (позбутися залежності від регістру). Тобто якщо введено або D, або d - повинен спрацювати один і той же case.
City= dict()
City['A'] = 'Moscow'
City['B'] = 'Kiev'
City['C'] = 'Washington'
City['D'] = 'Lviv'
City['E'] = 'Odessa'
print("Введите букву станции:")
a = input("Буква станции = ")
s=a.upper();
print(s)
print(City[s])